# *Class 5:*

### DataFrame:

In [1]:
import pandas as pd
import numpy as np

In [2]:
apples = pd.Series([1,2,3,4])
oranges = pd.Series([4,3,2,1])
data = {"Apples":apples,"Oranges":oranges}
f = pd.DataFrame(data)
print(f)

   Apples  Oranges
0       1        4
1       2        3
2       3        2
3       4        1

In [3]:
# Keep in Mind Index
apples = pd.Series([1,2,3,4], index = ["A","B","C","D"])
oranges = pd.Series([4,3,2,1], index = ["Mon","Tue","Wed","Thur"])

data = {"Apples":apples,"Oranges":oranges}
f = pd.DataFrame(data)
print(f)

      Apples  Oranges
A        1.0      NaN
B        2.0      NaN
C        3.0      NaN
D        4.0      NaN
Mon      NaN      4.0
Thur     NaN      1.0
Tue      NaN      3.0
Wed      NaN      2.0

In [4]:
apples = pd.Series([1,2,3,4], index = ["A","B","C","D"])
oranges = pd.Series([4,3,2,1], index = ["A","B","C","D"])

data = {"Apples":apples,"Oranges":oranges}
f = pd.DataFrame(data)
print(f)

   Apples  Oranges
A       1        4
B       2        3
C       3        2
D       4        1

In [5]:
state = ["Karachi","Karachi","Karachi","Lahore","Lahore","Lahore"]
year = [2000,2001,2002,2003,2004,2005]
pop = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

data = {"State":state,"Year":year,"Pop":pop}
f = pd.DataFrame(data)
print(f)

     State  Year  Pop
0  Karachi  2000  1.5
1  Karachi  2001  1.7
2  Karachi  2002  3.6
3   Lahore  2003  2.4
4   Lahore  2004  2.9
5   Lahore  2005  3.2

In [6]:
# Changing Index and shuffliing columns
state = ["Karachi","Karachi","Karachi","Lahore","Lahore","Lahore"]
year = [2000,2001,2002,2003,2004,2005]
pop = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

data = {"State":state,"Year":year,"Pop":pop}
f = pd.DataFrame(data, index = ["1st","2nd","3rd","4th","5th","6th"])
print(f)

       State  Year  Pop
1st  Karachi  2000  1.5
2nd  Karachi  2001  1.7
3rd  Karachi  2002  3.6
4th   Lahore  2003  2.4
5th   Lahore  2004  2.9
6th   Lahore  2005  3.2

In [7]:
c = pd.DataFrame(data, columns = ["Year","State","Pop"])
print(c)

   Year    State  Pop
0  2000  Karachi  1.5
1  2001  Karachi  1.7
2  2002  Karachi  3.6
3  2003   Lahore  2.4
4  2004   Lahore  2.9
5  2005   Lahore  3.2

In [8]:
# Adding extra column "Debt" But in Debt every value will be "NaN"
frame2 = pd.DataFrame(data, columns = ["Year","State","Pop","Debt"])
print(frame2)

   Year    State  Pop Debt
0  2000  Karachi  1.5  NaN
1  2001  Karachi  1.7  NaN
2  2002  Karachi  3.6  NaN
3  2003   Lahore  2.4  NaN
4  2004   Lahore  2.9  NaN
5  2005   Lahore  3.2  NaN

In [9]:
# df.head (It'll show you first 5 lines of your Data)
frame2 = pd.DataFrame(data, columns = ["Year","State","Pop","Debt"],
                     index = ["1st","2nd","3rd","4th","5th","6th"])
frame2.head()

     Year    State  Pop Debt
1st  2000  Karachi  1.5  NaN
2nd  2001  Karachi  1.7  NaN
3rd  2002  Karachi  3.6  NaN
4th  2003   Lahore  2.4  NaN
5th  2004   Lahore  2.9  NaN

In [10]:
# We can individually check index,column etc
print(frame2.columns)
print()
print(frame2.index)

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

In [11]:
#print(data)
#data["State"]

frame2["State"]

1st    Karachi
2nd    Karachi
3rd    Karachi
4th     Lahore
5th     Lahore
6th     Lahore
Name: State, dtype: object

In [12]:
frame2.Year

1st    2000
2nd    2001
3rd    2002
4th    2003
5th    2004
6th    2005
Name: Year, dtype: int64

In [13]:
a = frame2.loc["2nd"]
print(a)
print()
frame2.head()

Year        2001
State    Karachi
Pop          1.7
Debt         NaN
Name: 2nd, dtype: object

     Year    State  Pop Debt
1st  2000  Karachi  1.5  NaN
2nd  2001  Karachi  1.7  NaN
3rd  2002  Karachi  3.6  NaN
4th  2003   Lahore  2.4  NaN
5th  2004   Lahore  2.9  NaN

In [14]:
# the empty 'debt' column could be assigned a scalar value or an array of values
frame2["Debt"] = 20
frame2.head()

     Year    State  Pop  Debt
1st  2000  Karachi  1.5    20
2nd  2001  Karachi  1.7    20
3rd  2002  Karachi  3.6    20
4th  2003   Lahore  2.4    20
5th  2004   Lahore  2.9    20

In [15]:
#frame2.head()
ln = len(frame2)
a = np.arange(ln)
frame2["Debt"] = a
frame2

     Year    State  Pop  Debt
1st  2000  Karachi  1.5     0
2nd  2001  Karachi  1.7     1
3rd  2002  Karachi  3.6     2
4th  2003   Lahore  2.4     3
5th  2004   Lahore  2.9     4
6th  2005   Lahore  3.2     5

In [16]:
# point to remember , inserting new values, needs to be match in length of dataFrame (number of elements)
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2],
               index = ["One","Two","Three","Four",'Five',"Six","Seven"])
#print(val)
frame2["Debt"] = val
frame2

     Year    State  Pop  Debt
1st  2000  Karachi  1.5   NaN
2nd  2001  Karachi  1.7   NaN
3rd  2002  Karachi  3.6   NaN
4th  2003   Lahore  2.4   NaN
5th  2004   Lahore  2.9   NaN
6th  2005   Lahore  3.2   NaN

In [17]:
# index length must be equal to values ( or , do not provide index)
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print(obj3)
#obj3 =obj3.reindex(range(9))
#print(obj3)
obj3 =obj3.reindex(range(9),method="ffill")
print(obj3)
obj3 =obj3.reindex(range(2,11), method="ffill")
print(obj3)

0      blue
3    purple
6    yellow
dtype: object
0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object
2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

In [18]:
states = pd.DataFrame(np.arange(9).reshape((3,3)),index = ["a","b","c"],columns = ["Ohio","Texas","California"])
print(states)
print()
states = states.reindex(["a","b","c","d"],method = "ffill")
print(states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [19]:
states = pd.DataFrame(np.arange(9).reshape((3,3)),index = ["a","b","c"],columns = ["Ohio","Texas","California"])
print(states)
print()
states_name = ['Texas', 'Utah', 'California','Ohio']
states = states.reindex(columns=states_name)
print(states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

   Texas  Utah  California  Ohio
a      1   NaN           2     0
b      4   NaN           5     3
c      7   NaN           8     6

In [20]:
# Deleting data (row or column from dataframe) 
data2 = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=["Ohio","Texas","California","New York"],columns=["One","Two","Three","Four"])
print(data2)
print()
#data2.drop(["California", "Ohio"], inplace =True)
#print(data2)

#data2 = data2.drop("Three",axis=1)
data2.drop("Three", axis=1, inplace = True)
print(data2)

            One  Two  Three  Four
Ohio          0    1      2     3
Texas         4    5      6     7
California    8    9     10    11
New York     12   13     14    15

            One  Two  Four
Ohio          0    1     3
Texas         4    5     7
California    8    9    11
New York     12   13    15

In [21]:
data2 = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=["Ohio","Texas","California","New York"],columns=["One","Two","Three","Four"])
#print(data2)
print()
df2 = data2[["One","Three"]]
#print(df2)
print()

# Indexing same as Numpy
a = data2[2:]
#print(a)

# dicitonary like style of accessing data
b = data2["One"]
#print(b)

# filter on both row and column
c = data2.Three[2:]
#print(c)

# Conditonal Selection
d = data2.Three[data2["Three"] > 5]
#print(d)

#Boolean DatFrame
df2 = data2["Four"] > 5
print(df2)
print()

print(data2[data2["Four"] > 5])

Ohio          False
Texas          True
California     True
New York       True
Name: Four, dtype: bool

            One  Two  Three  Four
Texas         4    5      6     7
California    8    9     10    11
New York     12   13     14    15

In [22]:
print(data2)
print("\n")

# in "loc" method specify row label first then specify column names
a = data2.loc[["Ohio","Texas"],["Three","Four"]]
#print(a)

# in "iloc" use number instead of labels
b = data2.iloc[2,[1,2,3]]
#print(b)

c = data2.iloc[:2,:4]
#print(c)

print(data2.iloc[: , :2])

            One  Two  Three  Four
Ohio          0    1      2     3
Texas         4    5      6     7
California    8    9     10    11
New York     12   13     14    15


            One  Two
Ohio          0    1
Texas         4    5
California    8    9
New York     12   13

In [23]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list("abc"), 
                   index=["Karachi", "Lahore", "Islamabad"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list("bde"),
                    index=["Karachi", "Lahore", "Islamabad","KPK"])
#print(df1, "\n")
#print(df2, "\n")

# applying plus operation between two data frames
df3 = df1 + df2
print(df3)

df3["a"] = 5000
df3.loc["KPK","b"] = 4000
df3["c"] = 3000
df3["d"] = 2000
df3["e"] = 1000
print(df3)

            a     b   c   d   e
Islamabad NaN  13.0 NaN NaN NaN
KPK       NaN   NaN NaN NaN NaN
Karachi   NaN   1.0 NaN NaN NaN
Lahore    NaN   7.0 NaN NaN NaN
              a       b     c     d     e
Islamabad  5000    13.0  3000  2000  1000
KPK        5000  4000.0  3000  2000  1000
Karachi    5000     1.0  3000  2000  1000
Lahore     5000     7.0  3000  2000  1000

In [24]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                    columns=list('abcde'))
#print(df1)
#print(df2)

df2.loc[1,"b"] = np.nan
#print(df2)

df3 = df1 + df2
#print(df3)

# We can use add method for filling NaN cells with a value
# Nan will be replaced by 0 and then addition operation will apply

df3 = df1.add(df2,fill_value = 1)
print(df3)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0   6.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

In [25]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
            columns=list("abc"), 
                     index=["Utah", "Ohio", "Texas", "Oregon"])
#print(frame)
series = frame.iloc[:]
print(series, "\n")
# print("Values:", series.values, "\n")
# print("Index:", series.index, "\n")

#print(frame - series)

series = pd.Series([1,2,3], index = list("abc"))
#print("Values:", series.values, "\n")
#print("Index:", series.index, "\n")
print(frame - series)

          a     b     c
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

          a    b    c
Utah   -1.0 -1.0 -1.0
Ohio    2.0  2.0  2.0
Texas   5.0  5.0  5.0
Oregon  8.0  8.0  8.0

In [26]:
print(frame, "\n")

#print(frame["b"]. min())
#print(frame["b"].max())
#print(frame["a"].max() - frame["c"]. min())  # 8 -1 = 7

f = lambda x: x.max() - x.min()
#print(f)
#df = frame.apply(f)
#print(df, "\n")
#df = frame.apply(f, axis=1)
#print(df, "\n")

def min_max(x):
    return pd.Series( [x.max(), x.min() ], index=['min', 'max'])
df = frame.apply(min_max)
print(df)

          a     b     c
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

       a     b     c
min  9.0  10.0  11.0
max  0.0   1.0   2.0

In [27]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["Two", "One"],
                     columns=["A","B","C","D"])
print(frame, "\n")

# defaults in sort: axis = 0, ascending = True
print(frame.sort_index(axis = 1, ascending = False), "\n")
print(frame.sort_index())

     A  B  C  D
Two  0  1  2  3
One  4  5  6  7

     D  C  B  A
Two  3  2  1  0
One  7  6  5  4

     A  B  C  D
One  4  5  6  7
Two  0  1  2  3

In [28]:
# sort by values
print(frame.sort_values(by="C"))

print(frame.rank(ascending = False, method = "max"))
print(frame.rank(ascending = True, method = "min"))

     A  B  C  D
Two  0  1  2  3
One  4  5  6  7
       A    B    C    D
Two  2.0  2.0  2.0  2.0
One  1.0  1.0  1.0  1.0
       A    B    C    D
Two  1.0  1.0  1.0  1.0
One  2.0  2.0  2.0  2.0

In [29]:
#Summarizing and Computing Descriptive Statistics

df = pd.DataFrame([[1.4,np.nan], [7.1,7.2],
                  [np.nan,3.4], [np.nan,np.nan],
                  ], index = ["a","b","c","d"] ,columns = ["One","Two"])
print(df, "\n")
print(df.sum(), "\n")
print(df.sum(axis = "columns"))

   One  Two
a  1.4  NaN
b  7.1  7.2
c  NaN  3.4
d  NaN  NaN

One     8.5
Two    10.6
dtype: float64

a     1.4
b    14.3
c     3.4
d     0.0
dtype: float64

In [30]:
#print(df)
a = df.mean(axis = "columns", skipna = False)
print(a)

a     NaN
b    7.15
c     NaN
d     NaN
dtype: float64

In [39]:
ab = pd.DataFrame([[np.nan,2,2,np.nan],[3,2,np.nan,1],[7,8,np.nan,np.nan],[9,4,2,np.nan]],
                 index = ["One","Two","Three","Four"],columns = ["A","B","C","D"])
print(ab, "\n")
print(ab["A"].unique(), ab["D"].unique())
print()
ab["C"].value_counts()

         A  B    C    D
One    NaN  2  2.0  NaN
Two    3.0  2  NaN  1.0
Three  7.0  8  NaN  NaN
Four   9.0  4  2.0  NaN

[nan  3.  7.  9.] [nan  1.]

2.0    2
Name: C, dtype: int64